; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph2 - mode
	thermograph0 - mode
	infrared3 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star12 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star11 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
)
(:goal (and
	(pointing satellite0 Phenomenon18)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 image1)
	(have_image Planet15 image1)
	(have_image Phenomenon16 infrared3)
	(have_image Star17 image1)
	(have_image Phenomenon18 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation2 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet15 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet15)
   goals met: 0 of 7
5. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon16 instrument0 infrared3)
   added: (have_image phenomenon16 infrared3)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 3 of 7
10. (turn_to satellite0 star13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star13)
   goals met: 3 of 7
11. (take_image satellite0 star13 instrument0 infrared3)
   added: (have_image star13 infrared3)
   goals met: 4 of 7
12. (turn_to satellite0 star17 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star17)
   goals met: 4 of 7
13. (take_image satellite0 star17 instrument0 image1)
   added: (have_image star17 image1)
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 phenomenon18)
   goals met: 6 of 7
15. (take_image satellite0 phenomenon18 instrument0 infrared3)
   added: (have_image phenomenon18 infrared3)
   goals met: 7 of 7
